azkar_data = {
    1: {
        "Fajr": "يَا رَحِيمُ (133) مرتبہ پڑھیں۔",
        "Zohar": "يَا كَرِيمُ (133) مرتبہ پڑھیں۔",
        "Asar": "يَا رَزِّاقُ (200) مرتبہ پڑھیں۔",
        "Maghrib": "سُورہ فاتحة (40) مرتبہ پڑھیں۔",
        "Isha": "(۳۳ )  آل عمران آیت ۲۶",
    },
    2: {
        "Fajr": " (40) پنجم کلمہ استغفار سورۃ فاتحہ",
        "Zohar": " (40) سورۃ فاتحہ ",
        "Asar": "(25) درود ابراهیمی",
        "Maghrib": "(133) يَا وَهَّابُ",
        "Isha": "صلوۃ التسبیح ایک بار",
    },
     3: {
        "Fajr": " (111) يَا حَافِظُ",
        "Zohar": " (222)يَا نَاصِرُ",
        "Asar": "(25) يَا بَاسِطُ",
        "Maghrib": "(25) یت الکرسی",
        "Isha":"ُ (25) دُعائے کرب",
    },

     4: {
        "Fajr": " (40) سورۃ فاتحہ",
        "Zohar": " (133) يَا حَى يَا قَيُّومُ",
        "Asar": "(3) دُعائے جمیلہ",
        "Maghrib": "(11)سورة التين",
        "Isha": " (3) سورة المزمل ",
    },
     5: {
        "Fajr": " (3) اسمائے حسنی ۹۹ نام",
        "Zohar": " (17)  دُعائے کرب ",
        "Asar": "(2) سورة الملك   ",
        "Maghrib": "(200) دعائے مغفرت ",
        "Isha": "صلوۃ التسبیح ایک بار",
    },
    
     6: {
        "Fajr": " (21)   آل عمران آیت ۲۶  ",
        "Zohar": " (17)  دُعائے رزق ",
        "Asar": "(17)سورۃ الطلاق آیت ۲  ",
        "Maghrib": "(25)آیت الکرسی  ",
        "Isha": "(50) دعائے رزق ",
    },

     7: {
        "Fajr": " (200) يَا كَرِيمُ     ",
        "Zohar": " (33) پنجم کلمہ استغفار   ",
        "Asar": "(40) سورۃ فاتحہ  ",
        "Maghrib": "(70) سوم کلمہ تمجید   ",
        "Isha": "صلوۃ التسبیح ایک بار",
    },
    
     8: {
        "Fajr": " (1) سورة الفتح    ",
        "Zohar": " (25) دُعائے وسعت رزق   ",
        "Asar": "(100) پنجم کلمہ استغفار  ",
        "Maghrib": "(25) دعائے رزق ",
        "Isha": " (70) آل عمران آیت ۲۶   ",
    },

     9: {
        "Fajr": " (11) سورۃ التوبہ آخری دو آیات    ",
        "Zohar": " (11) سورة البقرة پہلا رکوع  ",
        "Asar": "(17) آل عمران آیت ۲۶   ",
        "Maghrib": "(11) سورۃ البقرۃ آخری دو آیات ",
        "Isha": " (1) صلوۃ الحاجات    ",
    },
    
     10: {
        "Fajr": " (70) پنجم کلمہ استغفار  ",
        "Zohar": " (17) دعائے کرب و پریشانی  ",
        "Asar": "(3) دعائے جمیلہ ",
        "Maghrib": "(40) دعائے نجات ",
        "Isha": " (1) سورۃ یسین  ",
    },

     11: {
        "Fajr": " (اپنی عمر کے مطابق پڑھیں) سورۃ فاتحہ   ",
        "Zohar": " (1)  سورة الفتح ",
        "Asar": "(17)آیت الکرسی  ",
        "Maghrib": "(55) درود شریف ",
        "Isha": "صلوۃ التسبیح ایک بار",
    },
     12: {
        "Fajr": "(40) دعائے رزق  ",
        "Zohar": " (11) سورة البقرة پہلا رکوع    ",
        "Asar": "(47) درود ابراہیمی  ",
        "Maghrib": "(11) سورۃ البقرۃ آخری دو آیات ",
        "Isha": " (40)  دعائے کرب ",
    },
    13: {
        "Fajr": " (40) سورة الجمعه آیت     ",
        "Zohar": " (47)  سورة الفلق   ",
        "Asar": "(47) سورۃ الناس   ",
        "Maghrib": "(11) دعائے نجات  ",
        "Isha": " (1) صلوۃ الحاجات  ",
    },
    14: {
        "Fajr": " (21)سورة التوبة آخری دو آیات    ",
        "Zohar": " (40) سورة فاتحہ    ",
        "Asar": "(25)  دعائے کرب ",
        "Maghrib": "(100) پنجم کلمہ استغفار  ",
        "Isha": " (20) نفل بطور شکرانه  ",
    },
    15: {
        "Fajr": " (3) سورة الفتح       ",
        "Zohar": " (1) صلوۃ الحاجات    ",
        "Asar": "(55) درود شریف   ",
        "Maghrib": "(17) دعائے کرب   ",
        "Isha": " (40)  آل عمران آیت ۲۶  ",
    },
    16: {
        "Fajr": " (47) سورۃ فاتحہ      ",
        "Zohar": " (11)  آیت الکرسی  ",
        "Asar": "(100) يَا حَيُّ يَا قَيُّومُ   ",
        "Maghrib": "(25) درود ابراہیمی  ",
        "Isha": " صلوۃ استیج ایک مرتبہ  ",
    },
     17: {
        "Fajr": " (2)سورة المزمل",
        "Zohar": " (40) سورة فاتحہ   ",
        "Asar": "(25) دعائے مغفرت   ",
        "Maghrib": "(47) پنجم کلمہ استغفار    ",
        "Isha": " سورۃ الفتح ایک مرتبہ  ",
    },
     18: {
        "Fajr": " (21) سورة التوبة آخری دو آیات       ",
        "Zohar": " (40) سورة الجمعه آیت ۴     ",
        "Asar": "(25) سورۃ الطلاق آیت ۳    ",
        "Maghrib": "(21) دعائے کرب   ",
        "Isha": " (1) سورۃ یسین  ",
    },
     19: {
        "Fajr": " (40) سورۃ الجمعه آیت ۴      ",
        "Zohar": " (33) آل عمران آیت ۲۶    ",
        "Asar": "(55) درود شریف   ",
        "Maghrib": "(11) سورۃ البقرہ آخری رکوع  ",
        "Isha": "استغفار  (300) صلوۃ التسبیح ایک بار",

    },
     20: {
        "Fajr": " (70) پنجم کلمہ استغفار  ",
        "Zohar": " (17) سات سلام    ",
        "Asar": "(27) آیت الکرسی   ",
        "Maghrib": "(33) درود ابراهیمی  ",
        "Isha": " صلوۃ الحاجات (1)  استغفار  (300) ",
    },
     21: {
        "Fajr": " (300) يَا حَافِظُ",
        "Zohar": " (300v)يَا نَاصِرُ",
        "Asar": "(300) يَا بَاسِطُ",
        "Maghrib": "(3) دعائے جمیلہ   ",
        "Isha": " (25) سورة الطلاق آیت ۳  ",
    },  
     22: {
        "Fajr": " (70)  سوم کلمہ تمجید    ",
        "Zohar": " (40) سورة الفاتحه    ",
        "Asar": "(100) پنجم کلمہ استغفار   ",
        "Maghrib": "(11/11) اول آخر کوع سوره بقره   ",
        "Isha": "(40)صلوة اتسبیح  (1) درود شریف ",
    },
     23: {
        "Fajr": " (11) سات سلام ",
        "Zohar": " (21) سورة التين    ",
        "Asar": "(100) پنجم کلمہ استغفار   ",
        "Maghrib": "(100) دعائے مغفرت   ",
        "Isha": " (40) دعائے نصرت   ",
    },
     24: {
        "Fajr": " (100) يَا حَيُّ يَا قَيُّومُ     ",
        "Zohar": " (40) سورۃ الفاتحہ    ",
        "Asar": "(25) دعائے نجات   ",
        "Maghrib": "(21) سورۃ التوبہ آخری دو آیات   ",
        "Isha": " (300) استغفار  ",
    },
    
     25: {
        "Fajr": " (40) سوم کلمہ تمجید ",
        "Zohar": " (300)  يَا رَحِيمُ   ",
        "Asar": "(200) الْوَلِيُّ الْوَالِي  ",
        "Maghrib": "(25) دعائے مغفرت   ",
        "Isha": "  پنجم کلمه(300) صلوۃ التسبیح ایک بار",
    },
     26: {    
        "Fajr": "(3) دعائے جمیلہ       ",
        "Zohar": " (40) سورة الفاتحه   ",
        "Asar": "(25)۲سورة الطلاق آیت     ",
        "Maghrib": "(300) يَا غَنِي   ",
        "Isha": "(40)دعائے نجات(25) سورة الفاتحه  ",
    },
     27: {
       "Fajr": " (17)  دعائے نصرت     ",
        "Zohar": " (40) درود ابراهیمی    ",
        "Asar": " لباس، خوراک کھانا   ",
        "Maghrib": "(40) سورۃ الجمعہ آیت ۴    ",
        "Isha": "استغفار  (500) صلوۃ التسبیح ایک بار",

    },
     28: {
        "Fajr": " (47) سورة الجمعه آیت ۲   ",
        "Zohar": " (11) سات سلام     ",
        "Asar": "(40)دعائے نجات(25)  درود شریف",
        "Maghrib": "(25)دعائے نجات    ",
        "Isha": "(111)صلوۃ الحاجات(1)   یاكَرِيمُ ",
    },
     29: {
        "Fajr": " (47) درود ابراهیمی     ",
        "Zohar": " (133) يَا عَلِيمُ    ",
        "Asar": "(40)  سورۃ الفاتحہ   ",
        "Maghrib": "(33) آل عمران آیت ۲۶    ",
        "Isha": "يَا رَحِيمُ(133) صلوۃ الحاجات(1)    ",
    },
     30: {
        "Fajr": " (200) يَا عَظِيمُ      ",
        "Zohar": " (200) يَارَزَّاقُ   ",
        "Asar": "(200) يَا حَكِيمُ   ",
        "Maghrib": "(200) يَاسَمِيعُ    ",
        "Isha": " صلوۃ الحاجات (1)  استغفار  (40) ",
    },

    # Add more for 30 days...
}

def get_azkar(day):
    return azkar_data.get(day, {
        "Fajr": "Azkar not added yet.",
        "Zohar": "Azkar not added yet.",
        "Asar": "Azkar not added yet.",
        "Maghrib": "Azkar not added yet.",
        "Isha": "Azkar not added yet.",
    })
